JMeter Tests/Test 5 - CalculationStressTest/locking_report/statistics.json
{
  "POST - Farmer Login" : {
    "transaction" : "POST - Farmer Login",
    "sampleCount" : 15,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3972.666666666667,
    "medianResTime" : 4040.0,
    "minResTime" : 1900.0,
    "maxResTime" : 5842.0,
    "pct1ResTime" : 5773.6,
    "pct2ResTime" : 5842.0,
    "pct3ResTime" : 5842.0,
    "throughput" : 0.7647208768799388,
    "receivedKBytesPerSec" : 0.9910005894723427,
    "sentKBytesPerSec" : 0.23598808309966865
  },
  "POST - Reader Login" : {
    "transaction" : "POST - Reader Login",
    "sampleCount" : 20,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3805.6500000000005,
    "medianResTime" : 3480.5,
    "minResTime" : 1591.0,
    "maxResTime" : 6843.0,
    "pct1ResTime" : 6683.600000000002,
    "pct2ResTime" : 6840.5,
    "pct3ResTime" : 6843.0,
    "throughput" : 1.0309278350515465,
    "receivedKBytesPerSec" : 1.3359777706185567,
    "sentKBytesPerSec" : 0.3181378865979382
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1715,
    "errorCount" : 105,
    "errorPct" : 6.122449,
    "meanResTime" : 1120.1772594752194,
    "medianResTime" : 1024.0,
    "minResTime" : 253.0,
    "maxResTime" : 6843.0,
    "pct1ResTime" : 1416.0000000000005,
    "pct2ResTime" : 2231.19999999999,
    "pct3ResTime" : 4937.359999999995,
    "throughput" : 15.773886170486737,
    "receivedKBytesPerSec" : 38.767080951537835,
    "sentKBytesPerSec" : 11.328498652551414
  },
  "POST - Admin Login" : {
    "transaction" : "POST - Admin Login",
    "sampleCount" : 5,
    "errorCount" : 5,
    "errorPct" : 100.0,
    "meanResTime" : 1656.8,
    "medianResTime" : 1646.0,
    "minResTime" : 1006.0,
    "maxResTime" : 2140.0,
    "pct1ResTime" : 2140.0,
    "pct2ResTime" : 2140.0,
    "pct3ResTime" : 2140.0,
    "throughput" : 0.505510059650187,
    "receivedKBytesPerSec" : 0.25176770548983923,
    "sentKBytesPerSec" : 0.15599724497017492
  },
  "GET - Read Under Locking (/api/farms)" : {
    "transaction" : "GET - Read Under Locking (/api/farms)",
    "sampleCount" : 600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1165.8799999999997,
    "medianResTime" : 1032.0,
    "minResTime" : 949.0,
    "maxResTime" : 5394.0,
    "pct1ResTime" : 1370.0,
    "pct2ResTime" : 1597.349999999999,
    "pct3ResTime" : 3864.1400000000017,
    "throughput" : 5.771061971587138,
    "receivedKBytesPerSec" : 17.048303187549894,
    "sentKBytesPerSec" : 4.035234737945695
  },
  "POST - Concurrent Farmer Write (/api/inquiries)" : {
    "transaction" : "POST - Concurrent Farmer Write (/api/inquiries)",
    "sampleCount" : 375,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 841.8293333333326,
    "medianResTime" : 596.0,
    "minResTime" : 488.0,
    "maxResTime" : 5377.0,
    "pct1ResTime" : 1186.4000000000005,
    "pct2ResTime" : 2294.999999999999,
    "pct3ResTime" : 4431.040000000002,
    "throughput" : 8.130610120983478,
    "receivedKBytesPerSec" : 6.391739401749708,
    "sentKBytesPerSec" : 7.050763464290361
  },
  "POST - Bulk Avg Yield Recalculation (/api/avg-yields)" : {
    "transaction" : "POST - Bulk Avg Yield Recalculation (/api/avg-yields)",
    "sampleCount" : 100,
    "errorCount" : 100,
    "errorPct" : 100.0,
    "meanResTime" : 583.47,
    "medianResTime" : 328.0,
    "minResTime" : 253.0,
    "maxResTime" : 4070.0,
    "pct1ResTime" : 910.2000000000002,
    "pct2ResTime" : 2660.199999999988,
    "pct3ResTime" : 4068.239999999999,
    "throughput" : 1.7646643608385684,
    "receivedKBytesPerSec" : 0.8754389602597586,
    "sentKBytesPerSec" : 0.8788855703395214
  },
  "GET - Read Harvests Under Locking (/api/farms/harvests)" : {
    "transaction" : "GET - Read Harvests Under Locking (/api/farms/harvests)",
    "sampleCount" : 600,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1172.5933333333323,
    "medianResTime" : 1033.0,
    "minResTime" : 952.0,
    "maxResTime" : 5195.0,
    "pct1ResTime" : 1348.6999999999998,
    "pct2ResTime" : 1527.9499999999998,
    "pct3ResTime" : 4787.880000000001,
    "throughput" : 5.818746060224021,
    "receivedKBytesPerSec" : 19.88260982883189,
    "sentKBytesPerSec" : 4.119717669592203
  }
}